#!/bin/bash

CURENT=`pwd`	#実行ディレクトリの保存
cd `dirname $0`	#解析コードのあるディレクトリで作業をする

#------------------------------------------------------------------
# 引数で設定された日付の確認、設定

if [ -n "$1" ]; then
    if [ "`date +'%Y%m%d' -d $1 2> /dev/null`" = $1 ]; then
        DATE=`date +"%Y%m%d" -d $1`
    else
        DATE=`date +"%Y%m%d"`
    fi
else
    DATE=`date +"%Y%m%d"`
fi

#------------------------------------------------------------------
# 解析の実行

perl ./GetCharaData.pl $DATE
perl ./UploadChara.pl $DATE

#------------------------------------------------------------------
# 事後処理

cd $CURENT  #元のディレクトリに戻る
